/*********************************************************************************************************************
/*文件名: encrytion.cpp
/*模块名: 命令解析 & 命令执行
/*作者:    邹天明&戴潜
/*日期:    2011.10.25
/*功能:    加密解密用户密码
/*
/*********************************************************************************************************************/


#include <iostream>
#include <string>
#include <conio.h>

#include "setcolor.h"

using namespace std;


/*********************************************************************************************************************
/*函数名:  Encrypt
/*输入: const string & cSrc
/*返回值:   string 
/*模块名:用户模块
/*功能描述: 加密
/*
/*********************************************************************************************************************/
string Encrypt(const string & cSrc)   
{   
	char   c;   
	string  cDest;
	unsigned int   i,h,l,j=0;   
	for   (i=0;i<cSrc.length();i++)   
	{   
		c=cSrc[i];   
		h=(c>>4)&0xf;   
		l=c&0xf;   
		cDest +=h+'x';   
		cDest +=l+'z';     
	}   
	return   cDest;   
}   


/*********************************************************************************************************************
/*函数名:  Decrypt
/*输入: const string & cSrc
/*返回值:  string 
/*模块名:用户模块
/*功能描述:解密
/*
/*********************************************************************************************************************/
string Decrypt(const string & cSrc) 
{   
	int   i,h,l,m,n,j=0;   
	string cDest;
	for   (i=0;i<cSrc.length();i=i+2)   
	{   
		h=(cSrc[i]-'x');   
		l=(cSrc[i+1]-'z');   
		m=(h<<4);   
		n=(l&0xf);   
		cDest +=(m   +   n);   
	}   
	 return   cDest;   
} 


